# Nested Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PlanRegionFailures..::..Nested Property
BuiltInFailures..::..PlanRegionFailures Class See Also
---
Cannot have nested Plan Regions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId Nested { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Nested As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ Nested {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PlanRegionFailures Class
Autodesk.Revit.DB Namespace